#+TITLE:   Go in monolith style
#+options: todo:t

*** DONE Removing the last character from a string

#+BEGIN_SRC go :results output  :imports "fmt"

words := "Hello world!"
words = words[0:len(words) - 1]

fmt.Println(words)
#+END_SRC

#+RESULTS:
: Hello world

*** DONE Remove characters in line that are not alphanumeric, sort, and take 5
  :PROPERTIES:
  :ARCHIVE_TIME: 2014-10-18 土 15:30
  :ARCHIVE_FILE: ~/repos/exercises-in-org/org/prog-styles/03-monolith/go.org
  :ARCHIVE_OLPATH: Snippets
  :ARCHIVE_CATEGORY: go
  :ARCHIVE_TODO: TODO
  :END:

#+BEGIN_SRC go :results output
  package main

  import (
          "fmt"
          "strings"
          "bytes"
          "sort"
  )

  type wordsSortableByFrequency []*wordWithFrequency

  type wordWithFrequency struct {
          word string
          frequency int
  }

  func (d wordsSortableByFrequency) Len() int {
          return len(d)
  }

  func (d wordsSortableByFrequency) Swap(i, j int) {
          d[i], d[j] = d[j], d[i]
  }

  func (d wordsSortableByFrequency) Less(i, j int) bool {
          return d[i].frequency < d[j].frequency
  }

  func main() {
          rawLine := "a a a a a a a a a a a a a almost no restrictions whatsoever.  You may copy it, give it away or"
          line := strings.ToLower(rawLine)
          fmt.Println(line)
          fmt.Println("------------------- char by char -------------------------")
          fmt.Println("")

          // Only print lowercase alphanumeric
          wordFrequency := make(map[string]int)
          var wordBuffer bytes.Buffer
          for _, c := range line {
                  if (c >= 97 && c < 123) {       // Filter alphanumeric
                          wordBuffer.WriteRune(c)
                  } else if c == 32 {             // Empty space, meaning that we have a word
                          // Accumulate the word
                          w := wordBuffer.String()
                          wordFrequency[w]++
                          wordBuffer.Truncate(0) // reset the buffer
                  }
          }

          // Turn the wordFrequency map into a list so that entries are comparable?
          //
          sortableWordsList := make(wordsSortableByFrequency, 0, len(wordFrequency))
          for word, frequency := range wordFrequency {
                  w := wordWithFrequency{ word, frequency }
                  sortableWordsList = append(sortableWordsList, &w) // pass reference
          }

          // Sort!
          //
          sort.Sort(sort.Reverse(sortableWordsList))
          for i, w := range sortableWordsList {
                  fmt.Println(w.word, " - ", w.frequency)
                  if i > 5 {
                          break
                  }
          }
  }

#+END_SRC

#+RESULTS:
#+begin_example
a a a a a a a a a a a a a almost no restrictions whatsoever.  you may copy it, give it away or
------------------- char by char -------------------------

a  -  13
it  -  2
  -  1
away  -  1
give  -  1
no  -  1
restrictions  -  1
#+end_example

